using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Lesson3._2
{
    class Program
    {
        static void Main(string[] args)
        {
            /*Написать алгоритм поиска Nго простого числа(к примеру 2, 3, 5, 7 где 2 это 1ое число 3 - второе и т.д., т.е.если N = 4 то на выходе должно быть 7)
            - Написать кальякулятор с множеством функций
            -Написать методы расчёта площади: прямоугольнику, круга, треугольника ну и любой другой фигуры
            -Найти среднефармфитическое значение массива
            - Дан двуменый массив заполненный случайными числами, необходимо высчитать значение суммы по столбцам и по строчкам

            * Написать игру крестики нолики для игры двумя игроками
            ** Если будет очень скучно попробовать написать примитивного соперника

            во всех задачах с массивами необходимо проинициализровать его случайными числами*/
        }
    }
}
